Tekla Open API Reference for Tekla Structures 2025
PickerInput Class
 The PickerInput class instances can be provided as predefined results of requests through the methods of the UI.Picker class.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputInterrupt
 Tekla.Structures.Drawing.PickerInputWithinAView
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract class PickerInput : IIsEqual
Public MustInherit Class PickerInput
	Implements IIsEqual
The PickerInput type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace